"4 ContributorsDating Game LyricsTalk show host :\nAnd we're back. Alright Becky, before our handsome bachelors reveal themselves\nYou have one last question to ask before you decide to go on that big date\n\nBecky :\nOK. Handsome bachelor number one\nOn our first date, where would you take me and how would you try to impress me?\n\nBachelor 1 (Jay-Z) :\nSo that's a… that's a good question ma\nThis is what I would do to impress you\nWell first of all, you know where I might take you ?\nI might take you over Dame's house\n\nBecky :\nOh, really?\n\nBachelor 1 :\nCus my girl's at the crib. And… then what I would do is…\nI'd get you the finest drink, of course it's gonna have ice in it\nAnd I don't mean frozen water… huh, ya know?!\n\nBecky :\nThat's so sweet\n\nBachelor 1 :\nAnd uh… what else would I do to really…\nI'd take you to Rodeo Drive, of course. Of course\nYou might also likeBecky :\nI love Rodeo\n\nBachelor 1 :\nIma take you to Rodeo and show you all the beautiful stores\nAnd what you could have if your record goes number one like mine haha\nThat's what I would do to… pretty impressive ain't it?\n\nBecky :\nOK, sounds like fun\nSame question, handsome bachelor number two\n\nBachelor 2 (RZA) :\nYo, to impwess you to take you out on a perfect womantic date\nMy idea for that is… to pick you up in a Wu mobile, bwought to you by Cwysler\n\nBecky :\nA Wu mobile?\n\nBachelor 2 :\nYou know, the cowabowation, that we just came wit\nAnd den, I take you upstate, to the amusement park, Wu-tang amusement parks\n\nBecky :\nOoh, I love parks!\nBachelor 2 :\nWord, we wide all kinda wollercoasters and fewwis wheels\n\nBecky :\nMm, that's my favorite!\n\nBachelor 2 :\nEat all kinda cotton candy, popcorn and shit\nAnd den, to welax you, or you know, give you a beauty treatment\nI'll take you down to the Wu spa\nWe got all the special manicuwists out there, you know, putting it down\n\nBecky :\nSounds good\n\nBachelor 2 :\nAnd to end all the night, you know, maybe we'll have a womantic dinner\nOrder out some Chinese food fwom Wu delivewy. We dewiwer 24 hours a day\nWord. Just call us on the tewephone, hit me, or…\nOr you could hit me on the 2-way, or Bwackbwewwy account\n\nBecky :\nWow! That maybe difficult to top!\nWhat would you do handsome bachelor number three?\n\nBachelor 3 (Ladies' Man) :\nYeah, listen. Can you repeat that question again please?\nBecky :\nOh, ok. You want me to repeat the question?\nOK, on our first date, where would you take me and how would you try to impress me?\n\nBachelor 3 :\nThat is a very good question. Heh, you're very charming\n\nBecky :\nThank you!\n\nBachelor 3 :\nWell, on the first date with me is… is very exciting\nI would, of course, take you wherever you wanted to go\nIf the plans was up to me, I would take you… to uh… to NASA\n\nBecky :\nLovely!\n\nBachelor 3 :\nWhat we would do is we would take a trip up that elevator\nAnd we would go and look at the stars, and I will pack us a picnic basket\n\nBecky :\nSweet\n\nBachelor 3 :\nAnd I would have us all kinds of… alcohol beverages\nI would whip out… that's right… I would whip out a diamond necklace\nPut it around you sweet, skinny neck\nAnd touch you in places that no doctor has ever discovered on you before\n\nBecky :\nWow\n\nBachelor 3 :\nAnd then I would slowly caress your breasts\nWork my way down to your… sweet lovin thighs, and then…\n\nTalk show host :\nOK, time's up\nWe'll find out your answer, Becky, after this commercial break1Embed"